0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.4                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		epsilon;
}

dimensions		[0 2 -3 0 0 0 0];

internalField		uniform 0.01;

boundaryField
{

    Symmetry
    {

        type		epsilonWallFunction;

        value		uniform 0.01;

    }

    Duct_Wall
    {

        type		epsilonWallFunction;

        value		uniform 0.01;

    }

    Walls
    {

        type		epsilonWallFunction;

        value		uniform 0.01;

    }

    outlet
    {

        type		inletOutlet;

        inletValue		uniform 0.1;

        value		uniform 0.1;

    }

    boundingbox_empty
    {

        type		empty;

    }

    Hole_Inlet_1200
    {

        type		fixedValue;

        value		uniform 0.01;

    }

}