0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.4                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		nut;
}

dimensions		[0 2 -1 0 0 0 0];

internalField		uniform 0;

boundaryField
{

    Symmetry
    {

        type		nutkWallFunction;

        value		uniform 0.01;

    }

    Duct_Wall
    {

        type		nutkWallFunction;

        value		uniform 0.01;

    }

    Walls
    {

        type		nutkWallFunction;

        value		uniform 0.01;

    }

    outlet
    {

        type		calculated;

        value		uniform 0;

    }

    boundingbox_empty
    {

        type		empty;

    }

    Hole_Inlet_1200
    {

        type		calculated;

        value		uniform 0;

    }

}