constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.4                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"constant";
	object		transportProperties;
}

transportModel		Newtonian;

nu		nu [0 2 -1 0 0 0 0] 1e-05;

beta		beta [0 0 0 -1 0 0 0] 3e-03;

TRef		TRef [0 0 0 1 0 0 0] 300;

Pr		Pr [0 0 0 0 0 0 0] 0.9;

Prt		Prt [0 0 0 0 0 0 0] 0.7;

Cp0		1000;