system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.4                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
	(-11.513800430297852 -10.243799993789249 0.4499999999999999)
	(9.988799858093262 -10.243799993789249 0.4499999999999999)
	(9.988799858093262 3.481800016141257 0.4499999999999999)
	(-11.513800430297852 3.481800016141257 0.4499999999999999)
	(-11.513800430297852 -10.243799993789249 0.54999999999999993)
	(9.988799858093262 -10.243799993789249 0.54999999999999993)
	(9.988799858093262 3.481800016141257 0.54999999999999993)
	(-11.513800430297852 3.481800016141257 0.54999999999999993)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (48 31 1) 
simpleGrading (
	1.0
	1.0
	1.0
	)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (       
	(1 2 6 5)
	(3 0 4 7)
	(0 1 5 4)
	(2 3 7 6)
       );
   }

   boundingbox_empty
   {
       type empty;
       faces
       (       
	(0 3 2 1)
	(4 5 6 7)
       );
   }
);

mergePatchPair
(
);
