system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.4                https://github.com/ladybug-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		snappyHexMeshDict;
}

castellatedMesh		true;

snap		true;

addLayers		false;

geometry
{

    Duct_Simulation430oclock_9.stl
    {

        type		triSurfaceMesh;

        name		Duct_Simulation430oclock_9;

        regions
        {

            Symmetry
            {

                name		Symmetry;

            }

            Duct_Wall
            {

                name		Duct_Wall;

            }

            Walls
            {

                name		Walls;

            }

            outlet
            {

                name		outlet;

            }

            Hole_Inlet_1200
            {

                name		Hole_Inlet_1200;

            }

        }

    }

}

castellatedMeshControls
{

    maxLocalCells		1000000;

    maxGlobalCells		2000000;

    minRefinementCells		10;

    maxLoadUnbalance		0.10;

    nCellsBetweenLevels		10;

    features		();

    refinementSurfaces
    {

        Duct_Simulation430oclock_9
        {

            level		(0 0);

            regions
            {

                Symmetry
                {

                    level		(0 0);

                }

                Duct_Wall
                {

                    level		(5 5);

                }

                Walls
                {

                    level		(0 0);

                }

                outlet
                {

                    level		(2 2);

                }

                Hole_Inlet_1200
                {

                    level		(7 7);

                }

            }

        }

    }

    resolveFeatureAngle		180;

    refinementRegions{}

    locationInMesh		(-4.4752222222222215 1.014 0.5);

    allowFreeStandingZoneFaces		true;

}

snapControls
{

    nSmoothPatch		5;

    tolerance		5;

    nSolveIter		100;

    nRelaxIter		8;

    nFeatureSnapIter		10;

    implicitFeatureSnap		true;

    multiRegionFeatureSnap		true;

}

addLayersControls
{

    relativeSizes		true;

    layers
    {

        Walls
        {

            nSurfaceLayers		10;

        }

    }

    expansionRatio		1.1;

    finalLayerThickness		0.7;

    minThickness		0.1;

    nGrow		0;

    featureAngle		110;

    nRelaxIter		3;

    nSmoothSurfaceNormals		1;

    nSmoothThickness		10;

    nSmoothNormals		3;

    maxFaceThicknessRatio		0.5;

    maxThicknessToMedialRatio		0.3;

    minMedianAxisAngle		130;

    nBufferCellsNoExtrude		0;

    nLayerIter		50;

    nRelaxedIter		20;

}

meshQualityControls
{

    maxNonOrtho		60;

    maxBoundarySkewness		20;

    maxInternalSkewness		4;

    maxConcave		80;

    minFlatness		0.5;

    minVol		1e-13;

    minTetQuality		1e-15;

    minArea		-1;

    minTwist		0.02;

    minDeterminant		0.001;

    minFaceWeight		0.02;

    minVolRatio		0.01;

    minTriangleTwist		-1;

    nSmoothScale		4;

    errorReduction		0.75;

    relaxed
    {

        maxNonOrtho		75;

    }

}

debug		0;

mergeTolerance		1E-6;